app/controllers/books_controller.rb

  def show
  	@booker = Book.find(params[:id])
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]

  def create
    @book = Book.new(book_params)
  	@book.user_id = current_user.id
  	if @book.save
  		flash[:notice] = "successfully created book!"
     	redirect_to book_path(id: @book.id)
    else
      @user = current_user
      @books = Book.all.order(created_at: :desc)
---
INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "aaaaa"], ["body", "ssddfyjj"], ["user_id", 2], ["created_at", "2018-11-10 08:28:48.515475"], ["updated_at", "2018-11-10 08:28:48.515475"]]
SELECT "books".* FROM "books" ORDER BY "books"."created_at" DESC

  def index
    @user = current_user
  	@book = Book.new
  	@books = Book.all.order(created_at: :desc)
---
SELECT "books".* FROM "books" ORDER BY "books"."created_at" DESC

  def update
  	@book = Book.find(params[:id])
  	@book.user_id = current_user.id
  	if @book.update(book_params)
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "books" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["title", "sedfgcdfモカgdが"], ["body", "dfvghggjdgbdgsf子dファゴ"], ["updated_at", "2018-11-11 03:30:51.567035"], ["id", 23]]