app/controllers/users_controller.rb

  def show
    @book = Book.new
    @user = User.find(params[:id])
    @books = @user.books.order(created_at: :desc)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "books".* FROM "books" WHERE "books"."user_id" = ? ORDER BY "books"."created_at" DESC  [["user_id", 2]]

  def index
    @user = current_user
    @users = User.all.order(created_at: :desc)
---
SELECT "users".* FROM "users" ORDER BY "users"."created_at" DESC