app/models/user.rb

SELECT  "users".* FROM "users" WHERE (username = '田中　太郎' OR lower(email) = lower('田中　太郎')) ORDER BY "users"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
  def self.find_first_by_auth_conditions(warden_conditions)
    conditions = warden_conditions.dup
    if login = conditions.delete(:login)
      where(conditions).where(["username = :value OR lower(email) = lower(:value)", { :value => login }]).first